<a target="_blank" href="https://colab.research.google.com/github/michalis0/Business-Intelligence-and-Analytics/blob/master/labs/02%20-%20Pandas%20and%20Python/walkthroughs/walkthrough_02_sol.ipynb">
  <img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/>
</a>

# Solutions
This notebook contains solutions to all the exercises from the Selecting Subsets of Data Series

1. [Part 1: Selection with [], .loc and .iloc](#Part-1:-Selection-with-[],-.loc-and-.iloc)
1. [Part 2: Boolean Indexing](#Part-2:-Boolean-Indexing)
1. [Part 3: Assigning subsets of data](#Part-3:-Assigning-subsets-of-data)
1. [Part 4: How NOT to select subsets of data](#Part-4:-How-NOT-to-select-subsets-of-data)

In [3]:
import pandas as pd
import numpy as np

# Part 1: Selection with `[]`, `.loc` and `.iloc`

In [ ]:
df = pd.read_csv('https://raw.githubusercontent.com/michalis0/Business-Intelligence-and-Analytics/master/week2%20-%20Pandas%20and%20Python/Pandas/data/food_inspections.csv')
df.head()

                    DBA Name  ...                                         Violations
0               DANY'S TACOS  ...  16. FOOD PROTECTED DURING STORAGE, PREPARATION...
1      BILLY FOOD MARKET INC  ...                                                NaN
2  TAQUERIA HACIENDA TAPATIA  ...  2. FACILITIES TO MAINTAIN PROPER TEMPERATURE -...
3     WILD GOOSE BAR & GRILL  ...  16. FOOD PROTECTED DURING STORAGE, PREPARATION...
4         PUBLICAN TAVERN K1  ...  18. NO EVIDENCE OF RODENT OR INSECT OUTER OPEN...

[5 rows x 9 columns]

### Exercise 1
<span  style="color:green; font-size:16px">The current DataFrame has a simple `RangeIndex`. Let make the **`DBA Name`** column the index to make it more meaningful. Save the result to variable **`df`**.</span>

In [ ]:
df = df.set_index('DBA Name')
df.head()

                          Facility Type  ...                                         Violations
DBA Name                                 ...
DANY'S TACOS                 Restaurant  ...  16. FOOD PROTECTED DURING STORAGE, PREPARATION...
BILLY FOOD MARKET INC               NaN  ...                                                NaN
TAQUERIA HACIENDA TAPATIA    Restaurant  ...  2. FACILITIES TO MAINTAIN PROPER TEMPERATURE -...
WILD GOOSE BAR & GRILL       Restaurant  ...  16. FOOD PROTECTED DURING STORAGE, PREPARATION...
PUBLICAN TAVERN K1           Restaurant  ...  18. NO EVIDENCE OF RODENT OR INSECT OUTER OPEN...

[5 rows x 8 columns]

### Exercise 2
<span  style="color:green; font-size:16px">Select the **`Risk`** column as a Series with just the indexing operator. Also select it with attribute access.</span>

In [ ]:
df['Risk'].head()

DBA Name
DANY'S TACOS                 Risk 1 (High)
BILLY FOOD MARKET INC         Risk 3 (Low)
TAQUERIA HACIENDA TAPATIA    Risk 1 (High)
WILD GOOSE BAR & GRILL       Risk 1 (High)
PUBLICAN TAVERN K1           Risk 1 (High)
Name: Risk, dtype: object

In [ ]:
df.Risk.head()

DBA Name
DANY'S TACOS                 Risk 1 (High)
BILLY FOOD MARKET INC         Risk 3 (Low)
TAQUERIA HACIENDA TAPATIA    Risk 1 (High)
WILD GOOSE BAR & GRILL       Risk 1 (High)
PUBLICAN TAVERN K1           Risk 1 (High)
Name: Risk, dtype: object

### Exercise 3
<span  style="color:green; font-size:16px">Select the **`Risk`** and **`Results`** columns</span>

In [ ]:
df[['Risk', 'Results']].head()

                                    Risk    Results
DBA Name
DANY'S TACOS               Risk 1 (High)       Fail
BILLY FOOD MARKET INC       Risk 3 (Low)  Not Ready
TAQUERIA HACIENDA TAPATIA  Risk 1 (High)       Pass
WILD GOOSE BAR & GRILL     Risk 1 (High)       Fail
PUBLICAN TAVERN K1         Risk 1 (High)       Fail

### Exercise 4
<span  style="color:green; font-size:16px">Select a single column as a DataFrame</span>

In [ ]:
df[['Zip']].head()

                               Zip
DBA Name
DANY'S TACOS               60623.0
BILLY FOOD MARKET INC      60624.0
TAQUERIA HACIENDA TAPATIA  60623.0
WILD GOOSE BAR & GRILL     60618.0
PUBLICAN TAVERN K1         60666.0

### Exercise 5
<span  style="color:green; font-size:16px">Select the row for the restaurant **`WILD GOOSE BAR & GRILL`**. What object is returned?</span>

In [ ]:
df.loc['WILD GOOSE BAR & GRILL'] # returns a Series

Facility Type                                             Restaurant
Risk                                                   Risk 1 (High)
Address                                          4265 N LINCOLN AVE
Zip                                                            60618
Inspection Date                                           03/27/2017
Inspection Type                                              Canvass
Results                                                         Fail
Violations         16. FOOD PROTECTED DURING STORAGE, PREPARATION...
Name: WILD GOOSE BAR & GRILL, dtype: object

### Exercise 6
<span  style="color:green; font-size:16px">Select the rows for the restaurants **`WILD GOOSE BAR & GRILL`** and **`TAQUERIA HACIENDA TAPATIA`** along with columns **`Risk`** and **`Results`**.</span>

In [ ]:
df.loc[['WILD GOOSE BAR & GRILL', 'TAQUERIA HACIENDA TAPATIA'], ['Risk', 'Results']]

                                    Risk Results
DBA Name
WILD GOOSE BAR & GRILL     Risk 1 (High)    Fail
TAQUERIA HACIENDA TAPATIA  Risk 1 (High)    Pass

### Exercise 7
<span  style="color:green; font-size:16px">What is the risk of restaurant **`SCRUB A DUB`**?</span>

In [ ]:
df.loc['SCRUB A DUB', 'Risk']

'Risk 2 (Medium)'

### Exercise 8
<span  style="color:green; font-size:16px">Select every 3,000th restaurant from **`THRESHOLD SCHOOL`** to **`SCRUB A DUB`** and the columns from **`Inspection Type`** on to the end of the DataFrame.</span>

In [ ]:
df.loc['THRESHOLD SCHOOL':'SCRUB A DUB':3000, 'Inspection Type':]

                               Inspection Type  ...                                         Violations
DBA Name                                        ...
THRESHOLD SCHOOL                       Canvass  ...  38. VENTILATION: ROOMS AND EQUIPMENT VENTED AS...
SAN JOSE FAST FOOD                     Canvass  ...                                                NaN
CHUCHOS ON ADDISON INC                 Canvass  ...  33. FOOD AND NON-FOOD CONTACT EQUIPMENT UTENSI...
PIZZERIA AROMA           Canvass Re-Inspection  ...  2. FACILITIES TO MAINTAIN PROPER TEMPERATURE -...
JEWEL FOOD STORE #3210                 Canvass  ...                                                NaN
EGANS TAVERN                           Canvass  ...                                                NaN
Los Amigos Grill                       Canvass  ...                                                NaN
JOHNNY VAN'S SMOKEHOUSE                License  ...                                                NaN
WEN   CAFE INC                 Out of Business  ...                                                NaN

[9 rows x 3 columns]

### Exercise 9
<span  style="color:green; font-size:16px">Select all columns from the 500th restaurant to the 510th</span>

In [ ]:
df.iloc[500:510]

                                  Facility Type  ...                                         Violations
DBA Name                                         ...
THE MECCA RESTAURANT                 Restaurant  ...  8. SANITIZING RINSE FOR EQUIPMENT AND UTENSILS...
L & T CHINA FAST WOK INC.            Restaurant  ...  33. FOOD AND NON-FOOD CONTACT EQUIPMENT UTENSI...
SCHNEIDER  SENIOR  APARTMENT       Golden Diner  ...  35. WALLS, CEILINGS, ATTACHED EQUIPMENT CONSTR...
ECKHARDT CAFE                        Restaurant  ...  33. FOOD AND NON-FOOD CONTACT EQUIPMENT UTENSI...
WING ZONE                            Restaurant  ...                                                NaN
ARBYS                                Restaurant  ...  34. FLOORS: CONSTRUCTED PER CODE, CLEANED, GOO...
LAS ISLAS MARIAS                     Restaurant  ...  30. FOOD IN ORIGINAL CONTAINER, PROPERLY LABEL...
MARGARET'S                           Restaurant  ...  33. FOOD AND NON-FOOD CONTACT EQUIPMENT UTENSI...
POPEYES FAMOUS FRIED CHICKEN         Restaurant  ...  3. POTENTIALLY HAZARDOUS FOOD MEETS TEMPERATUR...
PJ PIZZA COMPANY 1 DBA PAPA JOHNS    Restaurant  ...                                                NaN

[10 rows x 8 columns]

### Exercise 10
<span  style="color:green; font-size:16px">Select restaurants 100, 1,000 and 10,000 along with columns 5, 3, and 1</span>

In [ ]:
df.iloc[[100, 1000, 10000], [5, 3, 1]]

                           Inspection Type      Zip           Risk
DBA Name
TAQUERIA LA CANTERA                License  60608.0  Risk 1 (High)
PARK TAVERN CHICAGO              Complaint  60612.0  Risk 1 (High)
LITTLE VILLAGE HIGH SCHOOL         Canvass  60623.0  Risk 1 (High)

### Exercise 11
<span  style="color:green; font-size:16px">Select the **`Risk`** column and save it to a Series</span>

In [ ]:
risk = df['Risk']
risk.head()

DBA Name
DANY'S TACOS                 Risk 1 (High)
BILLY FOOD MARKET INC         Risk 3 (Low)
TAQUERIA HACIENDA TAPATIA    Risk 1 (High)
WILD GOOSE BAR & GRILL       Risk 1 (High)
PUBLICAN TAVERN K1           Risk 1 (High)
Name: Risk, dtype: object

### Exercise 12
<span  style="color:green; font-size:16px">Using the risk Series, select **`ARBYS`** and **`POPEYES FAMOUS FRIED CHICKEN`**</span>

In [ ]:
risk.loc[['ARBYS', 'POPEYES FAMOUS FRIED CHICKEN']]

DBA Name
ARBYS                             Risk 1 (High)
POPEYES FAMOUS FRIED CHICKEN    Risk 2 (Medium)
Name: Risk, dtype: object

# Part 2: Boolean Indexing

In [ ]:
import pandas as pd
import numpy as np

so = pd.read_csv('https://raw.githubusercontent.com/michalis0/Business-Intelligence-and-Analytics/master/week2%20-%20Pandas%20and%20Python/Pandas/data/stackoverflow_qa.csv')
so.head()

        id         creationdate  score  ...  quest_rep         ans_name  ans_rep
0  5486226  2011-03-30 12:26:50      4  ...      125.0  Mike Pennington  26995.0
1  5515021  2011-04-01 14:50:44      8  ...     3301.0  Mike Pennington  26995.0
2  5558607  2011-04-05 21:13:50      2  ...     3301.0     Wes McKinney  43310.0
3  6467832  2011-06-24 12:31:45      9  ...      117.0     Wes McKinney  43310.0
4  7577546  2011-09-28 01:58:38      9  ...      958.0             HYRY  54137.0

[5 rows x 12 columns]

### Exercise 1
<span  style="color:green; font-size:16px">Find all the questions that have exactly 5 answers.</span>

In [ ]:
so[so['answercount'] == 5].head()

           id         creationdate  score  ...  quest_rep      ans_name   ans_rep
75   10373660  2012-04-29 16:10:35    199  ...     2421.0  Wes McKinney   43310.0
115  10791661  2012-05-29 00:06:52      7  ...      958.0        lbolla    4552.0
130  10972410  2012-06-10 21:12:43     19  ...      895.0      BrenBarn  136870.0
189  11391969  2012-07-09 09:04:33     44  ...     9605.0  Wes McKinney   43310.0
246  11811392  2012-08-04 19:25:34     17  ...     1260.0      BrenBarn  136870.0

[5 rows x 12 columns]

### Exercise 2
<span  style="color:green; font-size:16px">Find all the questions that have less than 10 views</span>

In [ ]:
so[so['viewcount'] < 10].head()

             id         creationdate  score  ...  quest_rep ans_name  ans_rep
7787   26493306  2014-10-21 18:06:10      1  ...     3551.0      NaN      NaN
17653  33641540  2015-11-10 23:19:36      0  ...       88.0      NaN      NaN
29414  40062672  2016-10-15 18:24:21     -1  ...      186.0      NaN      NaN
36086  42538091  2017-03-01 17:20:37      0  ...      119.0      NaN      NaN
36340  42080039  2017-02-07 01:13:30      0  ...     2281.0     root  12202.0

[5 rows x 12 columns]

### Exercise 3
<span  style="color:green; font-size:16px">Find all the questions where the person asking it is the same as the person answering it</span>

In [ ]:
so[so['quest_name'] == so['ans_name']].head()

          id         creationdate  score  ...  quest_rep     ans_name  ans_rep
10   8273092  2011-11-25 18:39:02      1  ...     2279.0   codingknob   2279.0
33   9721429  2012-03-15 14:08:31      9  ...     3369.0  user1234440   3369.0
58  10020591  2012-04-04 23:17:23     21  ...    17129.0          bmu  17129.0
68  10175068  2012-04-16 13:27:44     15  ...    19551.0       elyase  19551.0
74  10264739  2012-04-22 02:35:06      9  ...     1752.0     vgoklani   1752.0

[5 rows x 12 columns]

### Exercise 4
<span  style="color:green; font-size:16px">Find all the questions that don't have an accepted answer, but have a score of more than 100</span>

In [ ]:
so[so['ans_name'].isnull() & (so['score'] > 100)]

            id         creationdate  score  ...  quest_rep ans_name  ans_rep
184   11350770  2012-07-05 18:57:34    149  ...      816.0      NaN      NaN
514   13148429  2012-10-30 22:22:59    312  ...     1689.0      NaN      NaN
527   13187778  2012-11-02 00:57:33    102  ...      511.0      NaN      NaN
560   13331698  2012-11-11 13:48:53    154  ...     7865.0      NaN      NaN
5013  19377969  2013-10-15 09:42:52    128  ...      831.0      NaN      NaN
5370  20845213  2013-12-30 18:24:25    130  ...      835.0      NaN      NaN
8289  26266362  2014-10-08 21:00:19    132  ...      661.0      NaN      NaN

[7 rows x 12 columns]

### Exercise 5
<span  style="color:green; font-size:16px">Find all the questions where the reputation of the person asking the question is higher than the person answering it. Then find the percentage of times this happens</span>

In [ ]:
quest_higher_rep = so[so['quest_rep'] > so['ans_rep']]
quest_higher_rep.head()

           id         creationdate  ...           ans_name  ans_rep
26    9588331  2012-03-06 17:01:47  ...  Jeff Hammerbacher   3172.0
51    9962114  2012-04-01 05:25:20  ...        Josh Hemann    590.0
99   10636024  2012-05-17 12:48:00  ...        user1319128    555.0
101  10671227  2012-05-20 06:14:57  ...             Karmel   2870.0
112  10760364  2012-05-25 19:33:39  ...              minrk  22244.0

[5 rows x 12 columns]

In [ ]:
# about 4% of the time
len(quest_higher_rep) / len(so)

0.039717720486542075

In [ ]:
# advanced - same solution
(so['quest_rep'] > so['ans_rep']).mean()

0.039717720486542075

### Exercise 6
<span  style="color:green; font-size:16px">Find all the questions where the number of answers is between 5 and 10 inclusive and the number of views is less than 1,000.</span>

In [ ]:
so[so['answercount'].between(5, 10) & (so['viewcount'] < 1000)].head()

            id         creationdate  score  ...  quest_rep  ans_name  ans_rep
620   13580875  2012-11-27 09:19:07      2  ...    15061.0  Victor K    332.0
1316  14742893  2013-02-07 03:13:31      2  ...      886.0       NaN      NaN
4816  21315997  2014-01-23 18:02:57      2  ...     1465.0      Jeff  62248.0
4958  19892107  2013-11-10 16:28:50      5  ...       32.0       NaN      NaN
5339  21040578  2014-01-10 09:33:09     -1  ...       16.0       NaN      NaN

[5 rows x 12 columns]

### Exercise 7
<span  style="color:green; font-size:16px">Find the inverse of exercise 6. Verify your results by adding the rows of both returned Series to see if it matches the number of rows of the original</span>

In [ ]:
ex6 = so[so['answercount'].between(5, 10) & (so['viewcount'] < 1000)]

criteria = (so['answercount'].between(5, 10) & (so['viewcount'] < 1000))
ex7 = so[~criteria]

In [ ]:
len(ex6) + len(ex7)

56398

In [ ]:
len(so)

56398

### Use the employee data for the rest of the exercises

In [5]:
employee = pd.read_csv('https://raw.githubusercontent.com/michalis0/Business-Intelligence-and-Analytics/master/week2%20-%20Pandas%20and%20Python/Pandas/data/employee.csv')
employee.head()

                POSITION_TITLE  ...    JOB_DATE
0  ASSISTANT DIRECTOR (EX LVL)  ...  2012-10-13
1            LIBRARY ASSISTANT  ...  2010-09-18
2               POLICE OFFICER  ...  2015-02-03
3            ENGINEER/OPERATOR  ...  1991-05-25
4                  ELECTRICIAN  ...  1994-10-22

[5 rows x 8 columns]

### Exercise 8
<span  style="color:green; font-size:16px">Find the females that have a salary over 100,000 OR males with salary under 50,000</span>

In [6]:
c1 = (employee['GENDER'] == 'Female') & (employee['BASE_SALARY'] > 100000)
c2 = (employee['GENDER'] == 'Male') & (employee['BASE_SALARY'] < 50000)
c_all = c1 | c2
employee[c_all].head()

                       POSITION_TITLE  ...    JOB_DATE
0         ASSISTANT DIRECTOR (EX LVL)  ...  2012-10-13
2                      POLICE OFFICER  ...  2015-02-03
7                           CARPENTER  ...  2013-11-04
9      AIRPORT OPERATIONS COORDINATOR  ...  2016-03-14
12  CUSTOMER SERVICE REPRESENTATIVE I  ...  2015-11-16

[5 rows x 8 columns]

### Exercise 9
<span  style="color:green; font-size:16px">Find the females in the following departments with salary over 60,000 (Parks & Recreation, Solid Waste Management, Fleet Management Department, Library)  </span>

In [7]:
deps = ['Parks & Recreation', 'Solid Waste Management', 'Fleet Management Department', 'Library']
c1 = employee['DEPARTMENT'].isin(deps) 
c2 = employee['GENDER'] == 'Female'
c3 = employee['BASE_SALARY'] > 60000

employee[c1 & c2 & c3]

                                POSITION_TITLE  ...    JOB_DATE
249                              STAFF ANALYST  ...  2015-07-18
412                 ADMINISTRATIVE COORDINATOR  ...  2005-04-02
476                  ADMINISTRATIVE SUPERVISOR  ...  2014-11-08
892                              LIBRARIAN III  ...  2002-06-15
1165  DEPUTY ASSISTANT DIRECTOR (EXECUTIVE LEV  ...  2014-03-15
1484    SENIOR STAFF ANALYST (EXECUTIVE LEVEL)  ...  2013-08-31

[6 rows x 8 columns]

### Exercise 10
<span  style="color:green; font-size:16px">Find all the males with salary over 100,000. Return only the ethnicity, gender and salary columns</span>

In [8]:
criteria = (employee['GENDER'] == 'Male') & (employee['BASE_SALARY'] > 100000)
employee.loc[criteria, ['ETHNICITY', 'GENDER', 'BASE_SALARY']].head()

                     ETHNICITY GENDER  BASE_SALARY
8                        White   Male     107962.0
11   Black or African American   Male     180416.0
43             Hispanic/Latino   Male     165216.0
169                      White   Male     120916.0
178                      White   Male     210588.0

### Exercise 11
<span  style="color:green; font-size:16px">Select all salaries as a Series in a separate variable. From this series select all salaries under 25,000</span>

In [9]:
s = employee['BASE_SALARY']
s[s < 25000]

454    24960.0
Name: BASE_SALARY, dtype: float64

### Exercise 12
<span  style="color:green; font-size:16px">Get the same exact result as exercise 11, but make your selection from the employee DataFrame. Use only a single line of code</span>

In [10]:
employee.loc[employee['BASE_SALARY'] < 25000, 'BASE_SALARY']

454    24960.0
Name: BASE_SALARY, dtype: float64

# Part 3: Assigning subsets of data

In [ ]:
import pandas as pd
import numpy as np

In [ ]:
df = pd.read_csv('https://github.com/michalis0/Business-Intelligence-and-Analytics/raw/master/week2%20-%20Pandas%20and%20Python/Pandas/data/employee_sample.csv', index_col=0)
df

          GENDER  NATIONALITY          DEPARTMENT  YEARS EXPERIENCE  SALARY
Tom         Male  Switzerland         Engineering                23  107962
Niko        Male          USA         Engineering                 1   30347
Penelope  Female  Switzerland         Engineering                12   60258
Aria      Female          USA         Engineering                 8   43618
Sofia     Female          USA  Parks & Recreation                23   26125
Dean        Male          USA  Parks & Recreation                 3   33592
Zach        Male  Switzerland  Parks & Recreation                 4   37565

In [ ]:
def style_diff(df, df_orig):
    style = {True: '', 
             False: 'color: red; background-color: yellow'}
    df_style = (df == df_orig).replace(style)
    return df.style.apply(lambda x: df_style, axis=None)

### Exercise 1
<span  style="color:green; font-size:16px"> Create a Series with the index equal to the same values in **`df`** but in a different order. Make the values of the Series integers representing the employee's age ranging somewhere from 20 to 65. Create a new column **`AGE`**. Does the order of the index matter?</span>

In [ ]:
s = pd.Series(data=[25, 30, 40, 50, 35, 36, 44],
              index=['Aria', 'Niko', 'Tom', 'Zach', 'Penelope', 'Sofia', 'Dean'])
s

Aria        25
Niko        30
Tom         40
Zach        50
Penelope    35
Sofia       36
Dean        44
dtype: int64

In [ ]:
df['AGE'] = s
df

          GENDER  NATIONALITY  ...  SALARY  AGE
Tom         Male  Switzerland  ...  107962   40
Niko        Male          USA  ...   30347   30
Penelope  Female  Switzerland  ...   60258   35
Aria      Female          USA  ...   43618   25
Sofia     Female          USA  ...   26125   36
Dean        Male          USA  ...   33592   44
Zach        Male  Switzerland  ...   37565   50

[7 rows x 6 columns]

The order of the index does not matter. They automatically align on their index.

### Exercise 2
<span  style="color:green; font-size:16px"> Create a new column **`BONUS`** equal to 0 for everyone</span>

In [ ]:
df['BONUS'] = 0
df

          GENDER  NATIONALITY          DEPARTMENT  ...  SALARY  AGE  BONUS
Tom         Male  Switzerland         Engineering  ...  107962   40      0
Niko        Male          USA         Engineering  ...   30347   30      0
Penelope  Female  Switzerland         Engineering  ...   60258   35      0
Aria      Female          USA         Engineering  ...   43618   25      0
Sofia     Female          USA  Parks & Recreation  ...   26125   36      0
Dean        Male          USA  Parks & Recreation  ...   33592   44      0
Zach        Male  Switzerland  Parks & Recreation  ...   37565   50      0

[7 rows x 7 columns]

### Exercise 3
<span  style="color:green; font-size:16px"> Change the **`BONUS`** column so that everyone with more than 10 years of experience get $10,000. Use the **`style_diff`** function to display the results.</span>

In [ ]:
df_orig = df.copy()
df.loc[df['YEARS EXPERIENCE'] > 10, 'BONUS'] = 10000
style_diff(df, df_orig)

### Exercise 4
<span  style="color:green; font-size:16px"> Create a new column **`TOTAL SALARY`** that is 10% higher than the current **`SALARY`** column and add the bonus on top of that as well. Use **`.loc`** on the left-hand side and NOT *just the indexing operator*. Make the data type **`TOTAL SALARY`** an integer.</span>

In [ ]:
df.loc[:, 'TOTAL SALARY'] = df['SALARY'] * 1.1 + df['BONUS']
df.loc[:, 'TOTAL SALARY'] = df.loc[:, 'TOTAL SALARY'].astype(int)
df

          GENDER  NATIONALITY          DEPARTMENT  ...  AGE  BONUS  TOTAL SALARY
Tom         Male  Switzerland         Engineering  ...   40  10000        128758
Niko        Male          USA         Engineering  ...   30      0         33381
Penelope  Female  Switzerland         Engineering  ...   35  10000         76283
Aria      Female          USA         Engineering  ...   25      0         47979
Sofia     Female          USA  Parks & Recreation  ...   36  10000         38737
Dean        Male          USA  Parks & Recreation  ...   44      0         36951
Zach        Male  Switzerland  Parks & Recreation  ...   50      0         41321

[7 rows x 8 columns]

In [ ]:
# in one line
df.loc[:, 'TOTAL SALARY'] = (df['SALARY'] * 1.1 + df['BONUS']).astype(int)
df

          GENDER  NATIONALITY          DEPARTMENT  ...  AGE  BONUS  TOTAL SALARY
Tom         Male  Switzerland         Engineering  ...   40  10000        128758
Niko        Male          USA         Engineering  ...   30      0         33381
Penelope  Female  Switzerland         Engineering  ...   35  10000         76283
Aria      Female          USA         Engineering  ...   25      0         47979
Sofia     Female          USA  Parks & Recreation  ...   36  10000         38737
Dean        Male          USA  Parks & Recreation  ...   44      0         36951
Zach        Male  Switzerland  Parks & Recreation  ...   50      0         41321

[7 rows x 8 columns]

### Exercise 5
<span  style="color:green; font-size:16px"> Set Aria's department to 'Police'. Highlight the change</span>

In [ ]:
df_orig = df.copy()
df.loc['Aria', 'DEPARTMENT'] = 'Police'
style_diff(df, df_orig)

### Exercise 6
<span  style="color:green; font-size:16px"> Use **`.iloc`** to change the age of the employees with integer location 3 and 5 to 60 and 65 respectively. Highlight the change.</span>

In [ ]:
df_orig = df.copy()
df.iloc[[3, 5], -3] = [60, 65]
style_diff(df, df_orig)

# Part 4: How NOT to select subsets of data

In [ ]:
import pandas as pd
import numpy as np

### Exercise 1
<span  style="color:green; font-size:16px"> Create a ten item list and then use chained indexing to select the items from 2 to the end and then from this subset, the first three items</span>

In [ ]:
a = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
a[2:][:3]

[3, 4, 5]

### Exercise 2
<span  style="color:green; font-size:16px"> Get the same result from example 1 with just a single call to the indexing operator.</span>

In [ ]:
a[2:5]

[3, 4, 5]

Use the following DataFrame for the next several questions

In [ ]:
df = pd.read_csv('https://raw.githubusercontent.com/michalis0/Business-Intelligence-and-Analytics/master/week2%20-%20Pandas%20and%20Python/Pandas/data/sample_data.csv', index_col=0)
df

          state  color    food  age  height  score
Jane         NY   blue   Steak   30     165    4.6
Niko         TX  green    Lamb    2      70    8.3
Aaron        FL    red   Mango   12     120    9.0
Penelope     AL  white   Apple    4      80    3.3
Dean         AK   gray  Cheese   32     180    1.8
Christina    TX  black   Melon   33     172    9.5
Cornelia     TX    red   Beans   69     150    2.2

### Exercise 3
<span  style="color:green; font-size:16px">Determine whether the following line of code is chained indexing. If it is, rewrite it so that it is not.</span>

In [ ]:
df[['state', 'food', 'color', 'score']]

          state    food  color  score
Jane         NY   Steak   blue    4.6
Niko         TX    Lamb  green    8.3
Aaron        FL   Mango    red    9.0
Penelope     AL   Apple  white    3.3
Dean         AK  Cheese   gray    1.8
Christina    TX   Melon  black    9.5
Cornelia     TX   Beans    red    2.2

No, this is the correct way of choosing several columns - with a list of strings.

### Exercise 4
<span  style="color:green; font-size:16px">Determine whether the following line of code is chained indexing. If it is, rewrite it so that it is not.</span>

In [ ]:
df.loc[['Niko', 'Penelope', 'Dean', 'Cornelia', 'Jane'], ['state', 'food', 'color', 'score']]

         state    food  color  score
Niko        TX    Lamb  green    8.3
Penelope    AL   Apple  white    3.3
Dean        AK  Cheese   gray    1.8
Cornelia    TX   Beans    red    2.2
Jane        NY   Steak   blue    4.6

No, this is the correct way to choose rows and columns. There is exactly one call to **`.loc`**. The row selection is simultaneously done with the column selection.

### Exercise 5
<span  style="color:green; font-size:16px">Determine whether the following line of code is chained indexing. If it is, rewrite it so that it is not.</span>

In [ ]:
df.loc[['Niko', 'Penelope', 'Dean', 'Cornelia', 'Jane']][['state', 'food', 'color', 'score']]

         state    food  color  score
Niko        TX    Lamb  green    8.3
Penelope    AL   Apple  white    3.3
Dean        AK  Cheese   gray    1.8
Cornelia    TX   Beans    red    2.2
Jane        NY   Steak   blue    4.6

This is chained indexing. There is one call to **`.loc`** which selects the rows and another call to *just the indexing operator* which selects the columns. The idiomatic solution is the code from exercise 4

### Exercise 6
<span  style="color:green; font-size:16px">Determine whether the following line of code is chained indexing. If it is, rewrite it so that it is not.</span>

In [ ]:
df.iloc[:5].iloc[2:, 1:4]

          color    food  age
Aaron       red   Mango   12
Penelope  white   Apple    4
Dean       gray  Cheese   32

This is chained indexing. There are two separate calls to **`.iloc`**. Fix it like this:

In [ ]:
df.iloc[2:5, 1:4]

          color    food  age
Aaron       red   Mango   12
Penelope  white   Apple    4
Dean       gray  Cheese   32

### Exercise 7
<span  style="color:green; font-size:16px">Determine whether the following line of code is chained indexing. If it is, rewrite it so that it is not.</span>

In [ ]:
df[df['state'] == 'TX']['age']

Niko          2
Christina    33
Cornelia     69
Name: age, dtype: int64

This is chained indexing. Use **`.loc`** for simultaneous boolean selection and column selection

In [ ]:
df.loc[df['state'] == 'TX', 'age']

Niko          2
Christina    33
Cornelia     69
Name: age, dtype: int64

### Exercise 8
<span  style="color:green; font-size:16px">Determine whether the following line of code is chained indexing. If it is, rewrite it so that it is not.</span>

In [ ]:
df[['state', 'food', 'age', 'height']][['state', 'age']].loc[['Jane', 'Aaron'], ['age', 'state']]

       age state
Jane    30    NY
Aaron   12    FL

This has three chains!

In [ ]:
df.loc[['Jane', 'Aaron'], ['age', 'state']]

       age state
Jane    30    NY
Aaron   12    FL

### Exercise 9
<span  style="color:green; font-size:16px">Change the score for all people who are over 30 years of age to 99 without doing chained indexing</span>

In [ ]:
df.loc[df['age'] < 30, 'score'] = 99
df

          state  color    food  age  height  score
Jane         NY   blue   Steak   30     165    4.6
Niko         TX  green    Lamb    2      70   99.0
Aaron        FL    red   Mango   12     120   99.0
Penelope     AL  white   Apple    4      80   99.0
Dean         AK   gray  Cheese   32     180    1.8
Christina    TX  black   Melon   33     172    9.5
Cornelia     TX    red   Beans   69     150    2.2

### Exercise 10
<span  style="color:green; font-size:16px">Select the **`color`** and **`food`** columns into their own variable.  Then write one more line of code that will trigger the **`SettingWithCopy`** warning</span>

In [ ]:
df1 = df[['color', 'food']]
df1

           color    food
Jane        blue   Steak
Niko       green    Lamb
Aaron        red   Mango
Penelope   white   Apple
Dean        gray  Cheese
Christina  black   Melon
Cornelia     red   Beans

In [ ]:
df1.loc[df['color'] == 'red', 'food'] = ['Watermelon', 'Gyros']

/usr/local/lib/python3.6/dist-packages/pandas/core/indexing.py:670: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  iloc._setitem_with_indexer(indexer, value)
/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [ ]:
df1

           color        food
Jane        blue       Steak
Niko       green        Lamb
Aaron        red  Watermelon
Penelope   white       Apple
Dean        gray      Cheese
Christina  black       Melon
Cornelia     red       Gyros

### Exercise 11
<span  style="color:green; font-size:16px">Select the **`color`** and **`food`** columns into their own variable like you did in exercise 10.  Do the same operation as you did without getting the warning.</span>

In [ ]:
df1 = df[['color', 'food']].copy()
df1.loc[df['color'] == 'red', 'food'] = ['Watermelon', 'Gyros']
df1

           color        food
Jane        blue       Steak
Niko       green        Lamb
Aaron        red  Watermelon
Penelope   white       Apple
Dean        gray      Cheese
Christina  black       Melon
Cornelia     red       Gyros

In [ ]:
df

          state  color    food  age  height  score
Jane         NY   blue   Steak   30     165    4.6
Niko         TX  green    Lamb    2      70   99.0
Aaron        FL    red   Mango   12     120   99.0
Penelope     AL  white   Apple    4      80   99.0
Dean         AK   gray  Cheese   32     180    1.8
Christina    TX  black   Melon   33     172    9.5
Cornelia     TX    red   Beans   69     150    2.2

### Exercise 12
<span  style="color:green; font-size:16px">Change the values of **`color`**, **`age`**, and **`score`** for **`Niko`** to anything you like</span>

In [ ]:
df.loc['Niko', ['color', 'age', 'score']] = ['RED', 999, -1]
df

          state  color    food  age  height  score
Jane         NY   blue   Steak   30     165    4.6
Niko         TX    RED    Lamb  999      70   -1.0
Aaron        FL    red   Mango   12     120   99.0
Penelope     AL  white   Apple    4      80   99.0
Dean         AK   gray  Cheese   32     180    1.8
Christina    TX  black   Melon   33     172    9.5
Cornelia     TX    red   Beans   69     150    2.2